Revit 2026 API

# IFCAggregateAdd Method

---

Adds an element to the aggregate.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void Add(
	IFCData ifcData
)
```
```vb
Public Sub Add (
	ifcData As IFCData
)
```
```cpp
public:
void Add(
	IFCData^ ifcData
)
```
```fsharp
member Add :
        ifcData : IFCData -> unit
```

#### Parameters

ifcData IFCData
     The IFCData element.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | The aggregate is not valid. |

#### Reference

IFCAggregate Class

Autodesk.Revit.DB.IFC Namespace